ipga/app/controllers/resources_controller.rb

SELECT * FROM `resources` WHERE (`resources`.`id` = 1)
---
  def show
    @resource = Resource.find(params[:id])

SELECT * FROM `resources` WHERE (`resources`.`id` = 1)
---
  def edit
    @resource = Resource.find(params[:id])

INSERT INTO `resources` (`updated_at`, `title`, `description`, `created_at`) VALUES('2009-06-21 03:46:40', 'test', 'test', '2009-06-21 03:46:00')
---
  def create
    @resource = Resource.new(params[:resource])
    @resource.owner = self.current_user
    if @resource.save

SELECT * FROM `resources` WHERE (`resources`.`id` = 1)
DELETE FROM `resources` WHERE `id` = 1
---
  def destroy
    @resource = Resource.find(params[:id])
    @resource.destroy